//
// Created by xulishuang on 17-11-8.
//
#ifndef PROJECT_TUZHENFEATURE_H
#define PROJECT_TUZHENFEATURE_H

#include "common.h"



/**************************************************************************************************************************************************
函数名：feacompare_open
函数功能：比对模块初始化函数
参数说明：
        ppvFeaCmpHandle：[out]输出比对模型的句柄
        deviceID: [in]GPU索引号
        feaitems：[in]特征条目数，用于计算预先分配显存大小
        objtype：[in]目标类型，人脸或行人，特征大小可能不同，0代表行人，1代表人脸
备注：算法句柄的内存和特征需要占用的显存分配在算法内部完成，在close函数中算法内部负责释放。
 **************************************************************************************************************************************************/
int feacompare_open(void **ppvFeaCmpHandle, int deviceID, int feaitems, EFeature_Cal_Type type, EFeature_Cmp_Type cmpType);


/**************************************************************************************************************************************************
函数名：feacompare_process
函数功能：对于某一个已经提取好的特征，和库里面所有样本进行比对，输出比对的结果，即相似度和索引id号。
参数说明：
        pvFeaCmpHandle：[in]输入比对模型的句柄
        res：[out]比对的相似度结果
        uuid：[out]相似度对应的索引id
        thresh:匹配阈值，与特定特征匹配度高于该阈值的才返回
备注：
 **************************************************************************************************************************************************/
int feacompare_process(void *pvFeaCmpHandle, std::string &feature, std::vector<float> &res, std::vector<std::string> &uuid,float thresh=0.6);


/**************************************************************************************************************************************************
函数名：feacompare_process
函数功能：对于某一个已经提取好的特征，和库里面所有样本进行比对，输出比对的结果，即相似度和索引id号。
参数说明：
        pvFeaCmpHandle：[in]输入比对模型的句柄
        res：[out]比对的相似度结果
        uuid：[out]相似度对应的索引id
备注：
 **************************************************************************************************************************************************/
int feature_match(void *pvFeaCmpHandle, std::string &feature, std::vector<float> &res, std::vector<std::string> &uuid);



/**************************************************************************************************************************************************
函数名：feacompare_addfeat
函数功能：将新样本的特征入库，对应的索引id号uuid预先设定好。
参数说明：
        pvFeaCmpHandle：[in]输入比对模型的句柄
        fea：[in]新特征的字符串
        uuid：[in]新特征的索引id号
备注：vector向量格式，一次性可以添加多个特征
 **************************************************************************************************************************************************/
int feacompare_addfeat(void *pvFeaCmpHandle, std::vector<std::string> &fea, std::vector<std::string> &uuid);


/**************************************************************************************************************************************************
函数名：feacompare_close
函数功能：释放 feacompare_open函数中开辟的资源
参数说明：
        pvFeaCmpHandle：[in]通过句柄将open分配的资源释放
备注：
 **************************************************************************************************************************************************/
void feacompare_close(void *pvFeaCmpHandle);


//zhfyuan 2018-03-06
/**************************************************************************************************************************************************
函数名：rsv_open(remove_same_video_open)
函数功能：初始化视频去重算法句柄并返回
参数说明：
        ppvRsvHandle: [out]视频去重算法句柄，这里进行初始化
        fsimthresh: 判断是否同一视频的阈值，默认0.7, 建议在0.4-0.9之间调节
        flag: [in]载入模式，默认载入到CPU
        feanum: [in]最大特征个数，一次性载入GPU，只有GPU模式有效
        deviceID:  [in]载入到GPU的ID号，当载入模式flag为EM_LOAD_MODE_GPU时有效，默认为0号GPU

返回值：EM_SUCESS_STATE： 成功调用;  other：调用失败
备注：目前只支持CPU模式
 **************************************************************************************************************************************************/
int rsv_open(void **ppvRsvHandle, float fsimthresh = 0.7, EVideofeature_Load_Mode flag = EM_LOAD_MODE_CPU, int feanum = 0, int deviceID = 0);

/**************************************************************************************************************************************************
函数名：rsv_setpara
函数功能：设置去重算法阈值，建议在0.4-0.9之间调节
参数说明：
        pvRsvHandle: [in]视频去重算法句柄
        fsimthresh: [in]判断是否同一视频的阈值

返回值：EM_SUCESS_STATE： 成功调用;  other：调用失败
 **************************************************************************************************************************************************/
int rsv_setpara(void *pvRsvHandle, float fsimthresh);


/**************************************************************************************************************************************************
函数名：rsv_loadfeature(remove_samevideo_loadfeature)
函数功能：将数据库中视频特征载入内存或显存
参数说明：
        pvRsvHandle: [in]视频去重算法句柄
        userdata: [in]视频的唯一标识，可以随时载入
        feature:  [in]视频的特征

返回值：EM_SUCESS_STATE： 成功调用;  EM_ERROR_INPUT：该userdata在数据库中已经存在或者特征的维度不正确
备注：load feature时，函数内部不保证待入库视频和库中视频内容不重复，如果不确定，需要调用其他函数比如rsv_checkvideo另做判断。
 **************************************************************************************************************************************************/
int rsv_loadfeature(void *pvRsvHandle, std::string userdata, std::string feature);


/**************************************************************************************************************************************************
函数名：rsv_checkvideo(remove_samevideo_checkvideo)
函数功能：判断输入视频是否已经和库中视频重复
参数说明：
        pvRsvHandle: [in]视频去重算法句柄
        inputvideopath: [in]输入待判断的视频路径
        feature：[in/out]输入视频的特征，如果未知，则一定要传入空的string，不能传入无意义的字符串，函数调用完成后，会将特征赋给该变量，避免loadfeature时重复计算
        sameuserdata:  [out]输出视频库中和该视频重复的那条视频标识，最多有一个，如果为空，则库中没有重复视频


返回值：EM_SUCESS_STATE： 成功调用;  other：调用失败
 **************************************************************************************************************************************************/
int rsv_checkvideo(void *pvRsvHandle, std::string inputvideopath, std::string& feature, std::string& sameuserdata);

/**************************************************************************************************************************************************
函数名：rsv_delvideo(remove_samevideo_delvideo)
函数功能：将数据库中视频特征删除
参数说明：
        pvRsvHandle: [in]视频去重算法句柄
        userdata: [in]视频的唯一标识
                

返回值：EM_SUCESS_STATE： 成功调用;  EM_ERROR_INPUT：该userdata在数据库中不存在
 **************************************************************************************************************************************************/
int rsv_delvideo(void *pvRsvHandle, std::string userdata);

/**************************************************************************************************************************************************
函数名：rsv_close(remove_samevideo_close)
函数功能：释放资源
参数说明：
        pvRsvHandle[in]通过句柄将open分配的资源释放
备注：
 **************************************************************************************************************************************************/
void rsv_close(void *pvRsvHandle);
\


#endif //PROJECT_TUZHENFEATURE_H
